#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.example will be created
  + resource "azurerm_kubernetes_cluster" "example" {
      + dns_prefix                 = "k8sqt-cluster"
      + enable_pod_security_policy = (known after apply)
      + fqdn                       = (known after apply)
      + id                         = (known after apply)
      + kube_admin_config          = (known after apply)
      + kube_admin_config_raw      = (sensitive value)
      + kube_config                = (known after apply)
      + kube_config_raw            = (sensitive value)
      + kubernetes_version         = (known after apply)
      + location                   = "northeurope"
      + name                       = "k8sqt-cluster"
      + node_resource_group        = (known after apply)
      + private_fqdn               = (known after apply)
      + resource_group_name        = "k8sqt-resources"
      + tags                       = (known after apply)

      + addon_profile {
          + aci_connector_linux {
              + enabled     = (known after apply)
              + subnet_name = (known after apply)
            }

          + azure_policy {
              + enabled = (known after apply)
            }

          + http_application_routing {
              + enabled                            = (known after apply)
              + http_application_routing_zone_name = (known after apply)
            }

          + kube_dashboard {
              + enabled = (known after apply)
            }

          + oms_agent {
              + enabled                    = (known after apply)
              + log_analytics_workspace_id = (known after apply)
            }
        }

      + agent_pool_profile {
          + availability_zones    = (known after apply)
          + count                 = (known after apply)
          + dns_prefix            = (known after apply)
          + enable_auto_scaling   = (known after apply)
          + enable_node_public_ip = (known after apply)
          + fqdn                  = (known after apply)
          + max_count             = (known after apply)
          + max_pods              = (known after apply)
          + min_count             = (known after apply)
          + name                  = (known after apply)
          + node_taints           = (known after apply)
          + os_disk_size_gb       = (known after apply)
          + os_type               = (known after apply)
          + type                  = (known after apply)
          + vm_size               = (known after apply)
          + vnet_subnet_id        = (known after apply)
        }

      + default_node_pool {
          + max_pods        = (known after apply)
          + name            = "agentpool"
          + node_count      = 1
          + os_disk_size_gb = 30
          + type            = "VirtualMachineScaleSets"
          + vm_size         = "Standard_B2s"
          + vnet_subnet_id  = (known after apply)
        }

      + linux_profile {
          + admin_username = "acctestuser1"

          + ssh_key {
              + key_data = "ssh-rsa AAAAB3NzaC1yc2EAAAABJQAAAQEA1JyyXQle9w4lUoDI6N7HhS0/cs6RyIBH6kFX54YeHJkpzRHBdCmy3PAVNtfX+j49WtuNMKuByNQV9iEpShLA8idkqrVmkw/UXJ8DJQr9lGiu3bwRcg3/6gC6/WB5rLaExwlri4KndPgMUSJimdDk7jJWCTPQ3PMiHfWBr0ZLcgPvZT4ZLwzhieuKaAxxoqu39ZXy2OL/XuQVpPePglucAItRwZl0YvSp4rwJsV3wQAl6Skybj+w5DEK4ttdIgLaZw60KAfrki5Z2gbMznvKWOqLGXEtw1ter4/+IEEDTNZAw+a7l+H4886zQC/2aOXNsqKBrJrotcMRKPJQxe2C8Nw== rsa-key-20200129"
            }
        }

      + network_profile {
          + dns_service_ip     = (known after apply)
          + docker_bridge_cidr = (known after apply)
          + load_balancer_sku  = "basic"
          + network_plugin     = "azure"
          + network_policy     = (known after apply)
          + pod_cidr           = (known after apply)
          + service_cidr       = (known after apply)

          + load_balancer_profile {
              + effective_outbound_ips    = (known after apply)
              + managed_outbound_ip_count = (known after apply)
              + outbound_ip_address_ids   = (known after apply)
              + outbound_ip_prefix_ids    = (known after apply)
            }
        }

      + role_based_access_control {
          + enabled = (known after apply)

          + azure_active_directory {
              + client_app_id     = (known after apply)
              + server_app_id     = (known after apply)
              + server_app_secret = (sensitive value)
              + tenant_id         = (known after apply)
            }
        }

      + service_principal {
          + client_id     = "65463efe-8f28-4fc4-a49d-225b06527f56"
          + client_secret = (sensitive value)
        }
    }

  # azurerm_resource_group.example will be created
  + resource "azurerm_resource_group" "example" {
      + id       = (known after apply)
      + location = "northeurope"
      + name     = "k8sqt-resources"
      + tags     = (known after apply)
    }

  # azurerm_subnet.example will be created
  + resource "azurerm_subnet" "example" {
      + address_prefix                                 = "10.1.1.0/24"
      + enforce_private_link_endpoint_network_policies = false
      + enforce_private_link_service_network_policies  = false
      + id                                             = (known after apply)
      + ip_configurations                              = (known after apply)
      + name                                           = "internal"
      + resource_group_name                            = "k8sqt-resources"
      + virtual_network_name                           = "k8sqt-network"
    }

  # azurerm_virtual_network.example will be created
  + resource "azurerm_virtual_network" "example" {
      + address_space       = [
          + "10.1.0.0/16",
        ]
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "k8sqt-network"
      + resource_group_name = "k8sqt-resources"
      + tags                = (known after apply)

      + subnet {
          + address_prefix = (known after apply)
          + id             = (known after apply)
          + name           = (known after apply)
          + security_group = (known after apply)
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Warning: Interpolation-only expressions are deprecated

  on resources.tf line 40, in resource "azurerm_kubernetes_cluster" "example":
  40:       key_data = "${var.public_ssh_key_path}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

```

</details>

*Workflow: `Terraform GitHub Actions`, Action: `hashicorpterraform-github-actions12`, Working Directory: `k8s`*
